app/views/current_user/feeds/entries.html.erb

		<ul class="list">
		<% @feed.entries.each do |entry| %>
---
SELECT `entries`.* FROM `entries` WHERE `entries`.`feed_id` = 3