app/views/current_user/feeds/index.html.erb

		<ul class="list">
		<% @user.feeds.each do |feed| %>
---
SELECT `feeds`.* FROM `feeds` WHERE `feeds`.`user_id` = 1