app/controllers/current_user/entries_controller.rb

	def index
		@user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

	def new
		@entry = Entry.new
		@user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

	def create
		@entry = Entry.create(entry_params)
		@user = User.find(params[:user_id])
---
INSERT INTO `entries` (`created_at`, `feed_id`, `name`, `updated_at`, `url`) VALUES ('2013-09-28 23:49:52', 3, 'tester', '2013-09-28 23:49:52', 'http://www.test.com/')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1