app/controllers/current_user/feeds_controller.rb

	def index
		session[:user] = params[:user_id]
		@user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

	def new
		@feed = Feed.new
		@user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

	def create
		@feed = Feed.create(feed_params)
		@feed.user_id = params[:user_id]
		@user = User.find(params[:user_id])
---
INSERT INTO `feeds` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2013-09-28 21:26:14', 'fgjklh fvjklv kljfv hdfjkh lvdfjk hvjklhfvhjklfvkj hldvhjklfvhjk lfvjklh fvkhjl fvkhj lv khjlvkjhl svjkh svkhjl svdkhj ldsvkjh svdkhj svdhjkl sdvkhjl svd', 'crap feed', '2013-09-28 21:26:14')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

	def destroy
		@feed = Feed.find(params[:id])
		@feed.destroy
---
SELECT `feeds`.* FROM `feeds` WHERE `feeds`.`id` = 1 LIMIT 1
DELETE FROM `feeds` WHERE `feeds`.`id` = 1

	def entries
		@user = User.find(params[:user_id])
		@feed = @user.feeds.find(params[:feed_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `feeds`.* FROM `feeds` WHERE `feeds`.`user_id` = 1 AND `feeds`.`id` = 3 LIMIT 1