app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `name`, `updated_at`) VALUES ('2013-09-28 20:33:49', 'whoughton@gmail.com', 'Wes Houghton', '2013-09-28 20:33:49')
---
	def create
		@user = User.create(user_params)