app/views/current_user/entries/index.html.erb

SELECT `entries`.* FROM `entries` INNER JOIN `feeds` ON `entries`.`feed_id` = `feeds`.`id` WHERE `feeds`.`user_id` = 1
---
		<ul class="list">
		<% @user.entries.each do |entry| %>

SELECT `feeds`.* FROM `feeds` WHERE `feeds`.`user_id` = 1
---
		<% end %>
		<% if @user.feeds.length < 1 %>