app/views/current_user/entries/new.html.erb

SELECT `feeds`.* FROM `feeds` WHERE (user_id = 1)
---
				<%= f.label :feed %>
				<%= collection_select(:entry, :feed_id, Feed.where('user_id = ?', @user.id), :id, :name) %>